#!/bin/bash
#################################——》二元比较
#-eq  ==  等于 equal
#-ne  !=  不等于 not equal
#-gt  >   大于 greater than
#-ge  >=  大于等于 greater equal
#-lt   <   小于 less than
#-le   <=   小于等于 less equal

#################################——》逻辑操作
-a  &&  and
-o  ||  or
！取非
#真1，假0

[ 2 < 1 ] && echo "正确" || echo "错误"
#正确，结果不对呀
#[]中特殊字符需要转义

[ 2 \< 1 ] && echo "正确" || echo "错误"
#错误
#[]中特殊字符需要转义
#==不需要转义；！=不需要转义

[[ 2 < 1 ]] && echo "正确" || echo "错误"
#错误
#双括号就不用转义啦

[ 2 -gt 1 ] && echo "正确" || echo "错误"
#错误
#字母也OK，不用转义


#字符串的比较，不能这样搞，下面是错误示例
[ "a" -gt "abc" ] && echo "正确" || echo "错误"
#先报错，再给结果错误

[ "abcde" -gt "abc" ] && echo "正确" || echo "错误"
#先报错，再给结果错误

[[ "abcde" -gt "abc" ]] && echo "正确" || echo "错误"
#不要这样搞，这个好像是变量
